import React from 'react'

const ProductTabContent = ({ selectedOption, pageContext }) => {
  return (
    <div className='container'>
      {selectedOption === 'info' && (
        <div className='product-info'>
          <h2>Опис</h2>
          <p>{pageContext.description}</p>
        </div>
      )}

      {selectedOption === 'delivery' && (
        <div className='product-info'>
          <h2>Доставка</h2>
          <p>
            Sushi з радістю доставляє вам улюблені роли безкоштовно по Києву! У
            зеленій та жовтій зонах нашої карти доставка – швидка, зручна та
            завжди вчасна! Мінімальна сума замовлення – 500 грн. Час доставки до
            59 хвилин у зеленій зоні. Якщо доставляти довше, ми обов’язково
            попередимо. Причини можуть бути різні: погода, затори та інші
            непередбачувані обставини. Доставка здійснюється нашими кур’єрами
            або партнерською службою Uklon – за наш рахунок! Час прийому
            замовлень: Щодня з 10:00 до 21:00 (Київський час). Самовивіз Не
            хочете чекати? Ласкаво просимо на самовивіз за адресою: Адреса 1
            Мінімальна сума замовлення на самовивіз не діє, просто забирайте
            свої улюблені роли! Доставка за межі зеленої та жовтої зон? Легко!
            Якщо ви знаходитеся в помаранчевій зоні, ми все одно готові радувати
            вас нашими стравами. Умови можуть змінюватись залежно від відстані –
            можлива збільшена мінімальна сума замовлення або часткова плата за
            доставку. Ми цінуємо ваш час і смаки! Якщо ми запізнимося – не
            соромтеся дати нам зворотний зв’язок. Обіцяємо виправитися та
            зробити все можливе для вашого задоволення!
          </p>
        </div>
      )}

      {selectedOption === 'payment' && (
        <div className='product-info'>
          <h2>Оплата</h2>
          <p>Тут буде інформація про оплату</p>
        </div>
      )}

      {selectedOption === 'reviews' && (
        <div className='product-info'>
          <h2>Відгуки</h2>
          <p>Тут будуть відгуки</p>
        </div>
      )}
    </div>
  )
}

export default ProductTabContent
